function setup() {
  createCanvas(600, 400);
  background(200);
  
  // 좌측 아래 원 
  noStroke();
  fill(140,75,120);
  circle(100,350,100);

  fill(140,75,120);
  circle(120,140,50);
  
  fill(140,75,120);
  circle(170,350,100);

  // 우측 아래 타원
  fill(60,90,180);
  ellipse(470,260,40,110);

  fill(60,90,180);
  ellipse(520,345,150,50);
  
  fill(60,90,180);
  ellipse(420,375,150,50);
  
  // 불안정한 길
  fill(0,0,0);
  triangle(50,300,50,200,200,200);
  
  fill(0,0,0);
  triangle(200,200,180,146,250,115);
  
  fill(0,0,0);
  triangle(250,115,225,100,255,60)
  
  fill(0,0,0);
  triangle(255,60,240,40,265,10)
  
  // 도달점
  fill(220,60,60);
  rect(500,00,100,50)
  
  fill(256,256,256);
  rect(450,50,150,40)

  fill(256,256,256);
  rect(430,90,20,100)
  
  // 단절
  fill(128,128,128);
  rect(350,230,80,20)
  
  fill(128,128,128);
  triangle(300,100,350,150,275,125)
  
  // 압박
  fill(70,140,200);
  arc(210,310,120,90,PI+2,PI+2.8);
  fill(70,140,200);
  arc(220,330,120,90,PI+2.5,PI+3.3);
  fill(70,140,200);
  arc(223,350,120,90,PI+3.0,PI+3.8);
  fill(70,140,200);
  arc(190,300,120,90,PI+1.5,PI+2.3);
 
  // 경계
  stroke(70,140,200)
  strokeWeight(10)
  fill(125,125,125)
  rectMode(RADIUS);
  rect(300,350,10,100)
}